"""
案例: 装饰器入门

装饰器介绍:
    概述/作用:
        它的本质是1个闭包函数,目的是 在不改变原有函数的
        基础上,对其功能增强
        大白话:装修队 在不改变房屋结构的情况下,对房屋进行装饰(功能增加)
    前提条件:
        1.有嵌套
        2.有引用
        3.有返回
        4.有额外功能
    装饰器的用法:
        格式1:传统写法
            装饰后的函数名 = 装饰器名(被装饰的原函数名)
            装饰后的函数()
        格式2.语法糖
            在要被装饰的原函数上,直接写 @装饰器名
            之后直接调用原函数即可


"""
from tokenize import Comment


#需求1:在发表评论前,都是需要先登录的

#1.定义函数
def check_login(fn_name):
    #1.1定义内部函数
    def fun_in():       #有嵌套
        #1.2额外功能
        print("登录中...")
        #1.3访问原函数,即:外部函数的引用
        fn_name()       #有引用
    #1.4返回内部函数对象
    return fun_in           #有返回

#2.定义函数
def comment():
    print("发表评论")


#3.测试
#3.1传统方式
Comment = check_login(comment)
Comment()



print("*"*35)
#3.2语法糖
@check_login
def payment():
    print("充值中...")
payment()

