"""
案例:深浅拷贝

记忆(总结):
    1.所谓的深浅拷贝分别指的是:
        浅拷贝:copy 模块的copy()方法
        深拷贝:copy 模块的deepcopy()方法
    2.大白话解释:
        深拷贝拷贝的多,浅拷贝拷贝的少.
    3.深浅拷贝主要是针对于可变类型来讲的,深拷贝拷贝所有层(可变),浅拷贝拷贝第一层(可变)
        如果是针对于不可变类型,则用法和 普通赋值是一致的

"""
import copy


def  dm01_普通赋值():
    #1. python中的赋值操作,属于引用赋值(把a的地址赋值给b)
    #2. b是a的别名,b和a指向同一个内存空间
    a = 10
    b = a
    print('id(a)-->', id(a))  # 0x01
    print('id(b)-->', id(b))  # 0x01
    print('id(10)-->', id(10))  # 0x01

    #3.也是引用赋值 c和d指向同一个内存空间
    a = [1, 2, 3]
    b = [11,22,33]
    c = [a,b]
    d = c
    print('id(c)-->', id(c))  # 0x03
    print('id(d)-->', id(d))  # 0x03

    #4. 值的方式赋值 a 指向一块内存空间, b 指向另一块内存空间
    # b = a python中不支持,这样做传参效率高

#浅拷贝可变类型: 只拷贝第一层数据,深层次数据不可拷贝
def dm02_浅拷贝可变类型():
    a = [1, 2, 3]
    b = [11, 22, 33]
    c = [6, 7, a, b]
    # 测试1 id(c)和id(d)
    d = copy.copy(c)      #浅拷贝 = 只会拷贝 可变类型的 第1层数据
    print('id(c)->', id(c))   # 0x03
    print('id(d)->', id(d))   # 0x04
    print("id(c)和id(d)值不一样，说明浅拷贝第1层(最外面一层的数据)")

    # 测试2
    print(id(c[2]))     # 0x01
    print(id(a))        # 0x01


    print("id(c[2]和id(a)值一样，说明浅拷贝第2层的数据")
    # 修改a[2] = 22
    a[2] = 22
    # c[0] = 100
    print('c->',c)      # [6, 7, [1, 2, 22], [11, 22, 33]]
    print('d->', d)     # [6, 7, [1, 2, 22], [11, 22, 33]]


#浅拷贝不可变类型:不会给拷贝的对象C开辟新的内存空间，而只是拷贝了这个对象的引用
def dm03_浅拷贝不可变类型():
    #不可变类型abc
    a= (1,2,3)
    b = (1, 22, 33)
    c=(6,7,a, b)
    d = copy.copy(c)
    print('id(c)->', id(c))      # 0x03
    print('id(d)->', id(d))      # 0x03

    print("id(c)和id(d)值一样，说明c和d指向相同的内存空问")



#深拷贝可变类型:若为可变类型开辟新的内存空问，所有层都会深拷贝
#作用:能保证数据的安全
def dm04_深拷贝可变类型():
    a = [1, 2, 3]
    b = [11, 22, 33]
    c = [6, 7, a, b]

    d = copy.deepcopy(c)
    print('id(c)->', id(c))   # 0x03
    print('id(d)->', id(d))   # 0x04

    a[1] =100
    b[1] =600
    print(f'c:{c}') # [6, 7, [1, 100, 3], [11, 600, 33]]
    print(f'd:{d}') # [6, 7, [1, 2, 3], [11, 22, 33]]


#深拷贝不可变类型:若为不可变类型直接就引用了,不会开辟新的内存空间

def dm05_深拷贝不可变类型():
    a = (1, 2, 3)
    b = (1, 22, 33)
    c = ( a, b)

    d = copy.deepcopy(c)
    print( id(c))  # 0x03
    print( id(d))  # 0x03
    print("c/d内存空间相同,说明c和d指向相同的内存空问")


# 在main函数中测试

if __name__ == '__main__':
    # dm01_普通赋值()
    # dm02_浅拷贝可变类型()          #多看看
    # dm03_浅拷贝不可变类型()
    # dm04_深拷贝可变类型()        #多看看
    dm05_深拷贝不可变类型()






